categorias.org
#+TITLE: Teoría de Categorías
#+AUTHOR: Mario Román
#+EMAIL: mromang08@gmail.com

#+LANGUAGE: es
#+SETUPFILE: math.setup
#+SETUPFILE: essay.setup

* Primera parte: Introducción a categorías
** Categorías
*** Definición de categoría
#+begin_definition
Una *categoría* ${\cal C}$ está formada por cite:brauer17 cite:aluffi09_prelim

 * ${\cal C}_0$, un conjunto grande[fn:clase] cuyos elementos se llaman *objetos*, y
 * ${\cal C}_1$, un conjunto grande cuyos elementos se llaman *morfismos*.

A cada morfismo $f \in {\cal C}_1$ se le asocian dos objetos, un *dominio*, $\mathrm{dom}(f) \in {\cal C}_0$, 
y un *codominio* $\mathrm{cod}(f) \in {\cal C}_0$; y solemos notarlo como

\[
f \colon \mathrm{dom}(f) \to \mathrm{cod}(f).
\]

Además, dados morfismos $f \colon A \to B$ y $g \colon B \to C$ existe su *morfismo composición*
$g \circ f \colon A \to C$; la composición de morfismos se exige asociativa y con elementos
neutros $\mathrm{id}_{A}\colon A \to A$. Es decir,

\[
h \circ (g \circ f) = (h \circ g) \circ f
\quad\text{ y }\quad
f \circ \mathrm{id}_A = f = \mathrm{id}_B \circ f.
\]
#+end_definition

#+begin_remark
Lo realmente importante en una categoría son los morfismos y cómo se
componen. Nótese que no trataremos el interior de los objetos; estos
sólo aparecen como dominio y codominio de los morfismos. Podemos
pensar en una categoría como la estructura algebraica que capta la
noción de composición.
#+end_remark

#+begin_definition
Notamos al conjunto de morfismos con dominio $A$ y codominio $B$ 
como $\mathrm{Hom}(A,B)$.[fn:clasemorfismo]
#+end_definition

En ocasiones será útil señalar explícitamente la categoría sobre la que
se consideran los morfismos. En esos casos se notará con un subíndice,
como $\mathrm{Hom}_{\cal C}(A,B)$. Al conjunto $\mathrm{Hom}(A,A)$ lo llamamos conjunto de
*endomorfismos* del objeto $A$ y lo notamos por $\mathrm{End}(A)$.

[fn:clase]: En la definición hemos usado explícitamente /conjuntos grandes/, más
comúnmente llamados /[[https://es.wikipedia.org/wiki/Clase_(teoría_de_conjuntos)][clases]]/, en lugar de conjuntos. En el futuro
querremos trabajar con categorías que contengan como objetos a todos
los conjuntos posibles; pero este tipo de construcciones causan problemas
en la teoría axiómatica de conjuntos tales como la 
[[https://es.wikipedia.org/wiki/Paradoja_de_Russell][paradoja de Russell]], así que usaremos esta definición más general para 
evitarlas.

[fn:clasemorfismo]: Nótese que la clase de morfismos entre dos objetos no
tiene por qué ser un conjunto en lugar de una clase. Las categorías con las
que trabajaremos, donde efectivamente es un conjunto, se llaman *categorías*
*localmente pequeñas*.

*** Ejemplos
**** Ejemplos básicos
Vamos a crear una categoría como ejemplo. En nuestra categoría, los
objetos serán $a,b,c$ y los morfismos serán $\mathrm{id}_a,\mathrm{id}_b,\mathrm{id}_c,f,g,h$, con los 
dominios y codominios siguientes

\[\begin{tikzcd}
a  \ar{dr}[swap]{h} \rar{f} & 
b  \dar{g} \\
& c
\end{tikzcd}\]

donde la única composición posible, además de las de las identidades,
la definimos como $f \circ g = h$. A esta forma de expresar morfismos la
llamamos *diagrama conmutativo*: escribimos una flecha entre dos
objetos para representar un morfismo entre ellos, las composiciones de
morfismos entre cualesquiera dos caminos entre dos objetos son iguales
y las identidades se omiten.

#+begin_definition
La *categoría vacía* se define como aquella con un conjunto de objetos
y de morfismos vacío.
#+end_definition

#+begin_definition
Una categoría de un solo objeto es un *monoide*.
#+end_definition

Para comprobar cómo coincide con nuestra definición usual de monoide,
debemos considerar los morfismos $f \colon A \to A$ como elementos del monoide
y la composición como la operación del monoide. El elemento neutro será
la identidad del objeto.

**** Categorías discretas
#+begin_definition
Llamamos *categoría discreta* a aquella que sólo tiene identidades como
morfismos; no existen morfismos entre dos objetos distintos.
#+end_definition

Nótese que cada categoría discreta viene determinada por una clase de
objetos y cada clase (o conjunto) de objetos define una única categoría
discreta.

**** Relaciones de orden
#+begin_lemma
Cada conjunto parcialmente ordenado define una categoría con sus elementos
como objetos y un único morfismo $\rho_{ab} \colon a \to b$ sólo cuando $a \leq b$.
#+end_lemma

#+begin_proof
Definimos la composición de la única forma posible, $\rho_{bc}\circ\rho_{ab}$ será $\rho_{ac}$, el
único morfismo $a \to c$, que además sabemos que existe porque si existen
$\rho_{ab}$ y $\rho_{bc}$, querrá decir que $a \leq b$ y que $b \leq c$; y por transitividad, $a \leq c$.
La asociatividad se tiene trivialmente porque entre dos objetos habrá,
a lo sumo, un solo morfismo.

La identidad $\mathrm{id}_a = \rho_{aa}$ existe por reflexividad y podemos comprobar 
trivialmente que es neutra respecto a la composición, ya que entre 
cualesquiera dos objetos existe a lo sumo un morfismo.
#+end_proof

Un ejemplo de relación de orden con sus morfismos podría ser la de
los divisores de $12$ con la divisibilidad. En el siguiente diagrama
dibujamos algunos de sus morfismos omitiendo las identidades

\[\begin{tikzcd}
& 12 & \\
6 \urar & & 4 \ular \\
3 \ar{uur} \uar & & 2\uar\ar{ull}\ar{uul} \\
& 1 \ular\urar\ar{uuu}\ar{uur}\ar{uul} & &.
\end{tikzcd}\]

#+begin_remark
Cada [[https://es.wikipedia.org/wiki/N%25C3%25BAmero_ordinal_(teor%25C3%25ADa_de_conjuntos)][ordinal]] define una relación de orden (un buen orden), que a su
vez define una categoría. Por ejemplo, la categoría asociada a $1$
será una categoría de un sólo objeto con la identidad, que también
puede verse como el monoide trivial. La categoría asociada a $2$ será
de la forma

\[\begin{tikzcd}
1 \ar[loop above]{u}{\mathrm{id}} \rar{f} & 2 \ar[loop above]{u}{\mathrm{id}} &,
\end{tikzcd}\]

y la categoría asociada a $\omega$ tendrá la forma

\[\begin{tikzcd}
1 \ar[loop above]{u} \rar \ar[bend right]{rr} \ar[bend right]{rrr} &
2 \ar[loop above]{u} \rar \ar[bend right]{rr} & 
3 \ar[loop above]{u} \rar \ar[bend right]{r} &
\dots & .
\end{tikzcd}\]
#+end_remark

**** Conjuntos
#+begin_lemma
Las aplicaciones entre conjuntos, con la composición usual, determinan
una categoría a la que llamaremos $\mathtt{Set}$.
#+end_lemma

#+begin_proof
Sabemos que la composición usual de aplicaciones entre conjuntos es
asociativa y que la identidad es un elemento neutro con la composición.
#+end_proof

