categorias.tex

\subsubsection{Grupos abelianos, espacios vectoriales, módulos}
\label{sec:org072a0e2}
\begin{lemma}
Los homomorfismos de \(R\text{-módulos}\) izquierdos (respectivamente derechos)
con la composición usual, determinan una categoría a la que llamaremos
\(R\mathtt{-Mod}\) (respectivamente \(\mathtt{Mod-}R\)).
\end{lemma}

\begin{proof}
Nótese que de nuevo la composición usual es asociativa y la identidad
es elemento neutro de la composición. Sólo nos falta comprobar que,
efectivamente, la composición de homomorfismos de módulos sigue siendo
un homomorfismo de módulos.
\end{proof}

\begin{corollary}
Los homomorfismos de grupos abelianos forman una categoría que llamaremos
\(\mathtt{Ab}\). Las funciones lineales entre \(k\text{-espacios vectoriales}\) forman una categoría
a la que llamaremos \(k\mathtt{-Vect}\).
\end{corollary}

\begin{proof}
Nótese que los grupos abelianos son los \(\mathbb{Z}\text{-módulos}\) y que los
espacios vectoriales son los módulos sobre un cuerpo.
\end{proof}

\subsubsection{Espacios topológicos}
\label{sec:org1297640}
\begin{lemma}
Las funciones continuas entre espacios topológicos, con la composición
usual, determinan una categoría a la que llamaremos \(\mathtt{Top}\).
\end{lemma}

\begin{proof}
Sabemos que la composición usual de funciones continuas es
asociativa y que la identidad es un elemento neutro con la composición.
Falta comprobar que la composición de continuas es continua.
\end{proof}

\section{Morfismos}
\label{sec:orgf4eb595}
\subsection{Isomorfismos}
\label{sec:org3651552}
\begin{definition}
Un morfismo \(f\colon A \to B\) es un \textbf{isomorfismo} si existe un morfismo inverso
\(f^{-1} \colon B \to A\) cumpliendo que

\[
f \circ f^{-1} = \mathrm{id} = f^{-1} \circ f.
\]
\end{definition}

\begin{fact}
La inversa de un morfismo, si existe, es única.
\end{fact}
\begin{proof}
Supongamos un morfismo \(f\colon A \to B\) con dos inversas \(g_1,g_2\), se tiene entonces

\[g_1 = g_1\circ 1_B = g_1(fg_2) = 1_Ag_2 = g_2
.\] \cite{aluffi09_prelim}
\end{proof}

\begin{definition}
Dos objetos \(A,B\) son \textbf{isomorfos} si existe un isomorfismo entre
ellos. La isomorfía se nota como \(A \cong B\).
\end{definition}

\begin{fact}
Son isomorfismos

\begin{itemize}
\item la identidad, con \(\mathrm{id}^{-1} = \mathrm{id}\).
\item el inverso de un isomorfismo, con \(\left( f^{-1} \right)^{-1} = f\).
\item la composición de isomorfismos, con \(\left( g\circ f \right)^{-1} = f^{-1} \circ g^{-1}\).
\end{itemize}

La isomorfía es por tanto una relación de equivalencia entre objetos.
\end{fact}

\begin{definition}
Llamamos además \textbf{automorfismos} a los \emph{endomorfismos} que sean
\emph{isomorfismos}.
\end{definition}

\subsection{Monomorfismos y epimorfismos}
\label{sec:org5c609e9}
\begin{definition}
Un morfismo \(f\colon A \to B\) es un \textbf{monomorfismo} si puede cancelarse a la izquierda
en la composición. Es decir, para cualquier par de morfismos \(g,h\) se cumple

\[
f \circ g = f \circ h \implies g = h.
\]
\end{definition}

\begin{definition}
Un morfismo \(f\colon A \to B\) es un \textbf{epimorfismo} si puede cancelarse a la derecha
en la composición. Es decir, para cualquier par de morfismos \(g,h\) se cumple

\[
g \circ f = h \circ f \implies g = h.
\]
\end{definition}

\begin{remark}
Un morfismo puede ser monomorfismo y epimorfismo sin tener una inversa
y ser isomorfismo; en este caso lo llamamos \textbf{bimorfismo}.
\end{remark}

\subsection{Ejemplos}
\label{sec:orga8f9ae5}
\subsubsection{Aplicaciones inyectivas y sobreyectivas en conjuntos}
\label{sec:org09c6100}
\begin{proposition}
En la categoría de conjuntos,

\begin{itemize}
\item una aplicación es inyectiva si y sólo si es monomorfismo.
\item una aplicación es sobreyectiva si y sólo si es epimorfismo.
\item una aplicación es biyectiva si y sólo si es isomorfismo.
\end{itemize}
\end{proposition}

\begin{proof}
Si \(f \colon A \to B\) es inyectiva, es trivialmente monomorfismo. Si
no es inyectiva, existen \(x,y\) tales que \(f(x) \neq f(y)\). Podemos
tomar las funciones \(g,h \colon \left\{ \ast \right\} \to A\) definidas como \(g(\ast) = x\) y
como \(h(\ast) = y\) y comprobar que \(f\) no es monomorfismo.

Si \(f \colon A \to B\) es sobreyectiva, es trivialmente epimorfismo. Si
no es sobreyectiva, podemos tomar dos \(g,h \colon B \to B \cup \left\{ \ast,\ast' \right\}\) y que 
para un \(x \notin \mathrm{im}(f)\), se definan como \(g|_{B-\{x\}} = h|_{B-\{x\}} = \mathrm{id}\) pero con
\(g(x) = \ast\) y \(h(x) = \ast'\).
\end{proof}

\subsubsection{Grupos}
\label{sec:org3ad2a9b}
\begin{definition}
Una categoría de un sólo objeto en la que todos los morfismos son
isomorfismos es un \textbf{grupo}.
\end{definition}

Como en el caso de los monoides, podemos tomar los automorfismos del
objeto como los elementos del grupo.

\subsubsection{Un bimorfismo no isomorfismo}
\label{sec:orgd3bfff5}
Consideremos la inclusión \(i\colon \mathbb{Q} \to \mathbb{R}\) en \(\mathtt{Top}\). Trivialmente es un 
monomorfismo por ser inyectiva. Además, es epimorfismo, ya que si 
tenemos \(g,h \colon \mathbb{R} \to A\) cumpliendo \(g \circ i = h \circ
i\), tendríamos \(g|_{\mathbb{Q}} = h|_{\mathbb{Q}}\);
y por continuidad, tendríamos \(g = h\).

Sin embargo no es un isomorfismo, no existen homeomorfismos entre
\(\mathbb{Q}\) y \(\mathbb{R}\), que serían los isomorfismos de \(\mathtt{Top}\). Lo único que usamos es
que la densidad de \(\mathbb{Q}\) en \(\mathbb{R}\) fuerza a que sólo exista una posible
extensión continua de las funciones definidas en \(\mathbb{Q}\) a funciones
definidas en \(\mathbb{R}\).

\section{Construcciones universales}
\label{sec:orga91269d}
\subsection{Objetos terminales}
\label{sec:orge2e71c0}
\begin{definition}
Un objeto \(I\) se dice \textbf{inicial} si desde cualquier otro objeto llega exactamente
un morfismo. Es decir, para todo \(A\), existe un único \(i \colon I \to A\).
\end{definition}

\begin{definition}
Un objeto \(T\) se dice \textbf{final} si desde cualquier otro objeto sale exactamente
un morfismo. Es decir, para todo \(A\), existe un único \(t\colon A \to T\).
\end{definition}

\begin{definition}
Llamamos \textbf{objeto cero} a un objeto que es a la vez inicial y final.
\end{definition}

Nótese que una categoría no tiene por qué tener objetos terminales, ni tienen
por qué ser únicos; pero sí serán únicos salvo isomorfismos.

\begin{fact}
Los objetos iniciales y finales de una categoría son \emph{esencialmente únicos},
es decir,

\begin{itemize}
\item dos objetos iniciales serán isomorfos.
\item dos objetos finales serán isomorfos.
\end{itemize}
\end{fact}
\begin{proof}
Si existieran dos objetos iniciales \(a,b\), tendríamos un único morfismo dado
por \(f \colon a \to b\) y un único morfismo dado por \(g \colon b \to a\). Pero además, sólo existe
un endomorfismo de \(a\) y de \(b\), que es en ambos casos la identidad; así que
\(g \circ f \colon a \to a\) y \(f \circ g \colon b \to b\) son la identidad.
\end{proof}

\subsection{Productos y coproductos}
\label{sec:orgf0a964d}
\begin{definition}
Un objeto \(C\) es el \textbf{producto} de dos objetos \(A,B\) cuando existen morfismos

\[\begin{tikzcd}[rowsep=tiny]
& C \drar{\pi_B}\dlar[swap]{\pi_A} & \\
A && B
\end{tikzcd}\]

tales que para cualquier objeto \(D\) con un par de morfismos \(f_1\colon D \to A\) 
y \(f_2\colon D \to B\), existe un único \(h \colon D \to C\) tal que \(f_1 = \pi_A\circ h\) y
\(f_2 = \pi_B\circ h\), como muestra el siguiente diagrama


\[\begin{tikzcd}[rowsep=tiny]
& D \dar[dashed]{\exists! h} \ar[bend left]{ddr}{f_1}\ar[bend right,swap]{ddl}{f_2} & \\
& C \drar{\pi_B}\dlar[swap]{\pi_A} & \\
A && B &.
\end{tikzcd}\]
\end{definition}

\begin{remark}
El producto no tiene por qué existir.
\end{remark}

\begin{proposition}
El producto, si existe, es único.
\end{proposition}
