categorias.org
**** Motivación del producto
En la categoría de los conjuntos, podemos tomar los conjuntos
siguientes $A = \left\{ \spadesuit, \clubsuit, \heartsuit, \diamondsuit \right\}$ y $B = \left\{ 1,2,\dots,13  \right\}$.
preguntarnos si existe su producto. Un producto de ambos conjuntos 
tendrá que tener un morfismo hacia cada uno de ellos, así que 
estudiaremos varios candidatos y comprobaremos que sólo uno de
ellos cumple la condición del producto, poniendo de relieve en
el proceso la necesidad de esta condición.

 * Un primer candidato a producto será el propio conjunto de símbolos
   $A$ con la identidad hacia
   el propio $A$ y una asignación constante de cualquier símbolo al
   número $1$, la función $k(\ast) = 1$.

   \[\begin{tikzcd}[rowsep=tiny]
   & A \dlar[swap]{\mathrm{id}}\drar{k} & \\
   A && B &.
   \end{tikzcd}\]

   Sin embargo, podemos demostrar que este no es un producto válido.
   En concreto, como la función $k$ no es sobreyectiva, podemos
   simplemente crear un par de morfismos desde el conjunto de un
   sólo elemento, $\left\{ x \right\}$, que lleguen a elementos fuera de su imagen
   
   \[\begin{tikzcd}[rowsep=tiny]
   & \left\{ \ast \right\} \dar[dashed]{?} \ar[bend left]{ddr}{x \mapsto 3}\ar[bend right,swap]{ddl}{x \mapsto \diamondsuit} & \\
   & A \drar{k}\dlar[swap]{\mathrm{id}} & \\
   A && B &,
   \end{tikzcd}\]
   
   y no podremos colocar ningún morfismo que haga cumplir la propiedad
   del producto. De aquí extraemos que el producto debe ser
   "suficientemente grande" como para que todos los morfismos puedan
   escribirse pasando por él, /cumplir la propiedad de existencia/.

 * Un segundo candidato a producto será $D$, un conjunto formado por
   dos números de $B$ y un símbolo de $A$, es decir

   \[
   D = \left\{ n\ast m \mid \ast \in A, n,m \in B \right\}
   \]

 * Nuestro tercer candidato a producto será $C$, el conjunto de los
   pares de elementos de $A$ y $B$, es decir

   \[
   C = \left\{ n\ast \mid \ast \in A, n \in B \right\},
   \]

   que tendrá elementos como $3\spadesuit$, con las proyecciones usuales $p_\ast,p_n$,
   que simplemente devuelven el número o el símbolo sin tener en cuenta el otro.

   \[\begin{tikzcd}[rowsep=tiny]
   & C \dlar[swap]{p_1}\drar{p_2} & \\
   A && B &.
   \end{tikzcd}\]


**** Categoría de los tipos                                     :noexport:
En un lenguaje de programación funcional puro, hay casos donde podemos
formar una categoría que tiene a los tipos como objetos y a las funciones
entre ellos como morfismos. Vamos a [[https://bartoszmilewski.com/2015/01/07/products-and-coproducts/][motivar la definición]] del producto
dentro de esta categoría. En particular, usaremos [[https://www.haskell.org/][Haskell]].

Supongamos que queremos calcular el producto de los objetos =Int= y
=String=. Primero tenemos que buscar un tipo que tenga dos funciones
hacia cada uno de ellos, por ejemplo, los tipos =Bool=, =(Int,String)=
o =(Int,Int,String)= tienen esta propiedad.

Podemos crear funciones del tipo =Bool= a cada uno de los tipos

#+BEGIN_SRC haskell
  boolInt :: Bool -> Int
  boolInt True  = 1
  boolInt False = 0

  boolString :: Bool -> String
  boolString True = "true"
  boolString False = "false"
#+END_SRC

del tipo =(Int,String)= a cada uno de los tipos

#+BEGIN_SRC haskell
  intstringint :: (Int,String) -> Int
  intstringint (i,s) = i
  
  intstringstring :: (Int,String) -> String
  intstringstring (i,s) = s
#+END_SRC

o incluso del tipo =(Int,Int,String)= a cada uno de los tipos

#+BEGIN_SRC haskell
  intstringint :: (Int,String) -> Int
  intstringint (i,s) = i
  
  intstringstring :: (Int,String) -> String
  intstringstring (i,s) = s
#+END_SRC

por lo que tenemos tres candidatos a producto. Ahora comprobaremos
que sólo uno de ellos cumple la condición del diagrama

\[\begin{tikzcd}[rowsep=tiny]
& D \dar[dashed]{\exists! h} \ar[bend left]{ddr}{f_1}\ar[bend right,swap]{ddl}{f_2} & \\
& C \drar{\pi_B}\dlar[swap]{\pi_A} & \\
A && B &.
\end{tikzcd}\]

**** Categoría de los conjuntos
En la categoría de los conjuntos, el conjunto vacío $\varnothing$ es el objeto
inicial, mientras que cualquier conjunto de un elemento $\left\{ \ast \right\}$ es el
objeto final. Nótese que el objeto final no es único, pero sí
/esencialmente único/.

El producto de dos conjuntos será su producto cartesiano $A \times B$ y
el coproducto de dos conjuntos será su unión disjunta $A \sqcup B$.

**** Categoría de las proposiciones
Dado un [[https://es.wikipedia.org/wiki/Dominio_de_discurso][dominio de discurso]], una proposición lógica $P$ implica otra
proposición lógica $Q$ si en cualquier modelo en el que se verifique
$P$ se verifica también $Q$. Esto se nota como $P \implies Q$. La
implicación es una relación transitiva y reflexiva
entre proposiciones; y por tanto, define una categoría que tiene como
objetos las proposiciones y un único morfismo entre cada dos
proposiciones sólo cuando una implica la otra.

El objeto inicial de esta categoría es una proposición que implica
todas las demás, la proposición falso $F$, que es simplemente falsa
en cualquier modelo. La proposición falsa
[[https://es.wikipedia.org/wiki/Principio_de_explosi%25C3%25B3n][implica todas las demás]] por reducción al absurdo. El objeto final
debe ser una proposición que es implicada por todas, la proposición
$T$ que es verdadera en cualquier modelo.

El objeto producto de $P$ y $Q$ es $P \wedge Q$, mientras que el objeto
coproducto de $P$ y $Q$ es $P \vee Q$.

** Recursos
Vídeos y artículos de introducción a la teoría de categorías.

 * Bartosz Milewski - /[[https://www.youtube.com/watch?v=I8LbkfSSR58&list=PLbgaMIhjbmEnaH_LTkxLI7FMa2HsnawM_&index=1][Category theory for programmers (Youtube)]]/.
 * Bartosz Milewski - /[[https://bartoszmilewski.com/category/category-theory/][Posts on category theory]]/.
 * The Catsters - /[[https://www.youtube.com/user/TheCatsters][Videos on category theory]]/.

Libros sobre álgebra y teoría de categorías básica.

 * *Aluffi, Paolo - /Algebra, Chapter 0/*. El inicio y la estructura de
   estos apuntes están basados en este libro. Presenta una introducción
   general al álgebra, pero usando como base la teoría de categorías.

bibliographystyle:unsrt
bibliography:math.bib

* Segunda parte: Funtores
** Funtores
*** Definición de funtor
*** Ejemplos
** Transformaciones naturales
*** Definición de transformación natural
*** Ejemplos
*** Composición vertical
*** Composición horizontal
** Lema de Yoneda
*** Funtores representables
*** Lema de Yoneda
** Adjunciones
*** Funtores adjuntos
*** Equivalencia de definiciones
*** Unicidad
** Recursos
Libros sobre álgebra y teoría de categorías.

 * *Mac Lane, Saunders - /Categories for the working mathematician/*.
   Es un libro completo dando una introducción general a teoría de
   categorías.

* Tercera parte: Límites
** Morfismos universales
*** Definición de morfismo universal
*** Ejemplos
** Límites
*** Definición de límite
** Ejemplos de límites
