categorias.tex

\subsection{Ejemplos}
\label{sec:orgcc1e86e}
\subsubsection{Motivación del producto}
\label{sec:orgc69b4ef}
En la categoría de los conjuntos, podemos tomar los conjuntos
siguientes \(A = \left\{ \spadesuit, \clubsuit, \heartsuit, \diamondsuit \right\}\) y \(B = \left\{ 1,2,\dots,13  \right\}\).
preguntarnos si existe su producto. Un producto de ambos conjuntos 
tendrá que tener un morfismo hacia cada uno de ellos, así que 
estudiaremos varios candidatos y comprobaremos que sólo uno de
ellos cumple la condición del producto, poniendo de relieve en
el proceso la necesidad de esta condición.

\begin{itemize}
\item Un primer candidato a producto será el propio conjunto de símbolos
\(A\) con la identidad hacia
el propio \(A\) y una asignación constante de cualquier símbolo al
número \(1\), la función \(k(\ast) = 1\).

\[\begin{tikzcd}[rowsep=tiny]
   & A \dlar[swap]{\mathrm{id}}\drar{k} & \\
   A && B &.
   \end{tikzcd}\]

Sin embargo, podemos demostrar que este no es un producto válido.
En concreto, como la función \(k\) no es sobreyectiva, podemos
simplemente crear un par de morfismos desde el conjunto de un
sólo elemento, \(\left\{ x \right\}\), que lleguen a elementos fuera de su imagen

\[\begin{tikzcd}[rowsep=tiny]
   & \left\{ \ast \right\} \dar[dashed]{?} \ar[bend left]{ddr}{x \mapsto 3}\ar[bend right,swap]{ddl}{x \mapsto \diamondsuit} & \\
   & A \drar{k}\dlar[swap]{\mathrm{id}} & \\
   A && B &,
   \end{tikzcd}\]

y no podremos colocar ningún morfismo que haga cumplir la propiedad
del producto. De aquí extraemos que el producto debe ser
"suficientemente grande" como para que todos los morfismos puedan
escribirse pasando por él, \emph{cumplir la propiedad de existencia}.

\item Un segundo candidato a producto será \(D\), un conjunto formado por
dos números de \(B\) y un símbolo de \(A\), es decir

\[
   D = \left\{ n\ast m \mid \ast \in A, n,m \in B \right\}
   \]

\item Nuestro tercer candidato a producto será \(C\), el conjunto de los
pares de elementos de \(A\) y \(B\), es decir

\[
   C = \left\{ n\ast \mid \ast \in A, n \in B \right\},
   \]

que tendrá elementos como \(3\spadesuit\), con las proyecciones usuales \(p_\ast,p_n\),
que simplemente devuelven el número o el símbolo sin tener en cuenta el otro.

\[\begin{tikzcd}[rowsep=tiny]
   & C \dlar[swap]{p_1}\drar{p_2} & \\
   A && B &.
   \end{tikzcd}\]
\end{itemize}


\subsubsection{Categoría de los conjuntos}
\label{sec:org4f655ed}
En la categoría de los conjuntos, el conjunto vacío \(\varnothing\) es el objeto
inicial, mientras que cualquier conjunto de un elemento \(\left\{ \ast \right\}\) es el
objeto final. Nótese que el objeto final no es único, pero sí
\emph{esencialmente único}.

El producto de dos conjuntos será su producto cartesiano \(A \times B\) y
el coproducto de dos conjuntos será su unión disjunta \(A \sqcup B\).

\subsubsection{Categoría de las proposiciones}
\label{sec:org6058dd8}
Dado un \href{https://es.wikipedia.org/wiki/Dominio\_de\_discurso}{dominio de discurso}, una proposición lógica \(P\) implica otra
proposición lógica \(Q\) si en cualquier modelo en el que se verifique
\(P\) se verifica también \(Q\). Esto se nota como \(P \implies Q\). La
implicación es una relación transitiva y reflexiva
entre proposiciones; y por tanto, define una categoría que tiene como
objetos las proposiciones y un único morfismo entre cada dos
proposiciones sólo cuando una implica la otra.

El objeto inicial de esta categoría es una proposición que implica
todas las demás, la proposición falso \(F\), que es simplemente falsa
en cualquier modelo. La proposición falsa
\href{https://es.wikipedia.org/wiki/Principio\_de\_explosi\%25C3\%25B3n}{implica todas las demás} por reducción al absurdo. El objeto final
debe ser una proposición que es implicada por todas, la proposición
\(T\) que es verdadera en cualquier modelo.

El objeto producto de \(P\) y \(Q\) es \(P \wedge Q\), mientras que el objeto
coproducto de \(P\) y \(Q\) es \(P \vee Q\).

\section{Recursos}
\label{sec:org6abf146}
Vídeos y artículos de introducción a la teoría de categorías.

\begin{itemize}
\item Bartosz Milewski - \emph{\href{https://www.youtube.com/watch?v=I8LbkfSSR58\&list=PLbgaMIhjbmEnaH\_LTkxLI7FMa2HsnawM\_\&index=1}{Category theory for programmers (Youtube)}}.
\item Bartosz Milewski - \emph{\href{https://bartoszmilewski.com/category/category-theory/}{Posts on category theory}}.
\item The Catsters - \emph{\href{https://www.youtube.com/user/TheCatsters}{Videos on category theory}}.
\end{itemize}

Libros sobre álgebra y teoría de categorías básica.

\begin{itemize}
\item \textbf{Aluffi, Paolo - \emph{Algebra, Chapter 0}}. El inicio y la estructura de
estos apuntes están basados en este libro. Presenta una introducción
general al álgebra, pero usando como base la teoría de categorías.
\end{itemize}

\bibliographystyle{unsrt}
\bibliography{math}
\end{document}